Autodesk.Revit.DB.MEPSupportUtils.CreateDuctworkStiffener(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Double)
Create family based stiffener on the specified fabrication ductwork.
document:
The document.
familySymbolId:
The id of a stiffener FamilySymbol.
hostId:
The id of the host ductwork.
distanceFromHostEnd:
The distance from the host primary end to place the hosted instance. Units are in feet (ft).
Returns:
The new stiffener family instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
familySymbolId is not a valid Element identifier.
-or-
hostId is not a valid Element identifier.
-or-
Invalid familySymbolId for stiffeners.
-or-
Host is not a straight ductwork.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The distance from host primary end is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The profiles of family symbol and host are mismatch.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
Failed to create stiffener due to document regenerate error.
Since:
2024

Autodesk.Revit.DB.MEPSupportUtils
General utility methods for the Autodesk Revit MEP Supporting components.
Since:
2024